# Next Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkIterator..::..Next Method
MEPNetworkIterator Class See Also
---
Moves this iterator to the next step of network iteration.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public void Next()
```

Visual Basic
---
```text
Public Sub Next
```

Visual C++
---
```text
public:
void Next()
```

# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace